google_dataplex_datascan.ui-scan-4: Refreshing state... [id=projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-4]
module.dataplex_test.google_dataplex_datascan.ui-scan-1: Refreshing state... [id=projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-1]
module.thelook.google_dataplex_datascan.tf-advanced-scan: Refreshing state... [id=projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/tf-advanced-scan]
module.dataplex_test.google_dataplex_datascan.ui-scan-3: Refreshing state... [id=projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-3]
google_dataplex_datascan.dev-scan: Refreshing state... [id=projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/dev-scan]
module.samples.google_dataplex_datascan.tf-dataquality-basic: Refreshing state... [id=projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/tf-dataquality-basic]
module.dataplex_test.google_dataplex_datascan.ui-scan-2: Refreshing state... [id=projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-2]
google_storage_bucket.default: Refreshing state... [id=spencer-tf-remote-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_dataplex_datascan.dev-scan will be destroyed
  # (because google_dataplex_datascan.dev-scan is not in configuration)
  - resource "google_dataplex_datascan" "dev-scan" {
      - create_time      = "2024-08-13T14:35:00.016892749Z" -> null
      - data_scan_id     = "dev-scan" -> null
      - effective_labels = {
          - "environment" = "dev"
        } -> null
      - execution_status = [] -> null
      - id               = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/dev-scan" -> null
      - labels           = {} -> null
      - location         = "us-central1" -> null
      - name             = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/dev-scan" -> null
      - project          = "ferrous-cipher-432403-j0" -> null
      - state            = "ACTIVE" -> null
      - terraform_labels = {} -> null
      - type             = "DATA_QUALITY" -> null
      - uid              = "d053edec-6aba-4146-a753-c4adb5d700fb" -> null
      - update_time      = "2025-03-26T05:48:54.703106652Z" -> null

      - data {
          - resource = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/dev_47c30c8a/tables/dev" -> null
        }

      - data_quality_spec {
          - sampling_percent = 100 -> null

          - rules {
              - column      = "order_id" -> null
              - description = "Sample rule for non-null column" -> null
              - dimension   = "COMPLETENESS" -> null
              - ignore_null = false -> null
              - name        = "non-null" -> null
              - threshold   = 1 -> null

              - non_null_expectation {}
            }
          - rules {
              - column      = "user_id" -> null
              - description = "Sample rule for non-null column" -> null
              - dimension   = "COMPLETENESS" -> null
              - ignore_null = false -> null
              - name        = "non-null" -> null
              - threshold   = 1 -> null

              - non_null_expectation {}
            }
          - rules {
              - column      = "created_at" -> null
              - description = "Sample rule for non-null column" -> null
              - dimension   = "COMPLETENESS" -> null
              - ignore_null = false -> null
              - name        = "non-null" -> null
              - threshold   = 1 -> null

              - non_null_expectation {}
            }
          - rules {
              - column      = "order_id" -> null
              - description = "Sample rule for unique column" -> null
              - dimension   = "UNIQUENESS" -> null
              - ignore_null = false -> null
              - name        = "unique" -> null
              - threshold   = 0 -> null

              - uniqueness_expectation {}
            }
          - rules {
              - column      = "status" -> null
              - description = "Sample rule for values in a set" -> null
              - dimension   = "VALIDITY" -> null
              - ignore_null = false -> null
              - name        = "one-of-set" -> null
              - threshold   = 0 -> null

              - set_expectation {
                  - values = [
                      - "Shipped",
                      - "Complete",
                      - "Processing",
                      - "Cancelled",
                      - "Returned",
                    ] -> null
                }
            }
          - rules {
              - column      = "num_of_item" -> null
              - description = "Sample rule for values in a range" -> null
              - dimension   = "VALIDITY" -> null
              - ignore_null = false -> null
              - name        = "range-values" -> null
              - threshold   = 0.99 -> null

              - range_expectation {
                  - max_value          = "1" -> null
                  - strict_max_enabled = false -> null
                  - strict_min_enabled = false -> null
                }
            }
          - rules {
              - description = "Sample rule for a non-empty table" -> null
              - dimension   = "VALIDITY" -> null
              - ignore_null = false -> null
              - name        = "not-empty-table" -> null
              - threshold   = 0 -> null

              - table_condition_expectation {
                  - sql_expression = "COUNT(*) > 0" -> null
                }
            }
        }

      - execution_spec {
          - trigger {
              - on_demand {}
            }
        }
    }

  # google_dataplex_datascan.ui-scan-4 will be destroyed
  # (because google_dataplex_datascan.ui-scan-4 is not in configuration)
  - resource "google_dataplex_datascan" "ui-scan-4" {
      - create_time      = "2025-05-27T19:30:33.160893697Z" -> null
      - data_scan_id     = "ui-scan-4" -> null
      - description      = "Made this in UI" -> null
      - display_name     = "ui-scan-4" -> null
      - effective_labels = {} -> null
      - execution_status = [
          - {
              - latest_job_end_time   = "2025-05-27T19:31:44.617710359Z"
              - latest_job_start_time = "2025-05-27T19:31:16.369Z"
            },
        ] -> null
      - id               = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-4" -> null
      - labels           = {} -> null
      - location         = "us-central1" -> null
      - name             = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-4" -> null
      - project          = "ferrous-cipher-432403-j0" -> null
      - state            = "ACTIVE" -> null
      - terraform_labels = {} -> null
      - type             = "DATA_QUALITY" -> null
      - uid              = "8bc0031c-deb0-4594-871c-3d7a61cebc94" -> null
      - update_time      = "2025-05-27T19:30:38.360038728Z" -> null

      - data {
          - resource = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/dataplex_test/tables/walmart_sales" -> null
        }

      - data_quality_spec {
          - sampling_percent = 100 -> null

          - rules {
              - column      = "Temperature" -> null
              - dimension   = "COMPLETENESS" -> null
              - ignore_null = false -> null
              - threshold   = 1 -> null

              - non_null_expectation {}
            }
        }

      - execution_spec {
          - trigger {
              - on_demand {}
            }
        }
    }

  # module.dataplex_test.google_dataplex_datascan.ui-scan-4 will be created
  + resource "google_dataplex_datascan" "ui-scan-4" {
      + create_time      = (known after apply)
      + data_scan_id     = "ui-scan-4"
      + description      = "Made this in UI"
      + display_name     = "ui-scan-4"
      + effective_labels = (known after apply)
      + execution_status = (known after apply)
      + id               = (known after apply)
      + location         = "us-central1"
      + name             = (known after apply)
      + project          = "ferrous-cipher-432403-j0"
      + state            = (known after apply)
      + terraform_labels = (known after apply)
      + type             = (known after apply)
      + uid              = (known after apply)
      + update_time      = (known after apply)

      + data {
          + resource = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/dataplex_test/tables/walmart_sales"
        }

      + data_quality_spec {
          + sampling_percent = 100

          + rules {
              + column      = "Temperature"
              + dimension   = "COMPLETENESS"
              + ignore_null = false
              + threshold   = 1

              + non_null_expectation {}
            }
        }

      + execution_spec {
          + trigger {
              + on_demand {}
            }
        }
    }

  # module.dev_47c30c8a.google_dataplex_datascan.dev-scan will be created
  + resource "google_dataplex_datascan" "dev-scan" {
      + create_time      = (known after apply)
      + data_scan_id     = "dev-scan"
      + effective_labels = (known after apply)
      + execution_status = (known after apply)
      + id               = (known after apply)
      + location         = "us-central1"
      + name             = (known after apply)
      + project          = "ferrous-cipher-432403-j0"
      + state            = (known after apply)
      + terraform_labels = (known after apply)
      + type             = (known after apply)
      + uid              = (known after apply)
      + update_time      = (known after apply)

      + data {
          + resource = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/dev_47c30c8a/tables/dev"
        }

      + data_quality_spec {
          + sampling_percent = 100

          + rules {
              + column      = "order_id"
              + description = "Sample rule for non-null column"
              + dimension   = "COMPLETENESS"
              + ignore_null = false
              + name        = "non-null"
              + threshold   = 1

              + non_null_expectation {}
            }
          + rules {
              + column      = "user_id"
              + description = "Sample rule for non-null column"
              + dimension   = "COMPLETENESS"
              + ignore_null = false
              + name        = "non-null"
              + threshold   = 1

              + non_null_expectation {}
            }
          + rules {
              + column      = "created_at"
              + description = "Sample rule for non-null column"
              + dimension   = "COMPLETENESS"
              + ignore_null = false
              + name        = "non-null"
              + threshold   = 1

              + non_null_expectation {}
            }
          + rules {
              + column      = "order_id"
              + description = "Sample rule for unique column"
              + dimension   = "UNIQUENESS"
              + ignore_null = false
              + name        = "unique"
              + threshold   = 0

              + uniqueness_expectation {}
            }
          + rules {
              + column      = "status"
              + description = "Sample rule for values in a set"
              + dimension   = "VALIDITY"
              + ignore_null = false
              + name        = "one-of-set"
              + threshold   = 0

              + set_expectation {
                  + values = [
                      + "Shipped",
                      + "Complete",
                      + "Processing",
                      + "Cancelled",
                      + "Returned",
                    ]
                }
            }
          + rules {
              + column      = "num_of_item"
              + description = "Sample rule for values in a range"
              + dimension   = "VALIDITY"
              + ignore_null = false
              + name        = "range-values"
              + threshold   = 0.99

              + range_expectation {
                  + max_value          = "1"
                  + strict_max_enabled = false
                  + strict_min_enabled = false
                }
            }
          + rules {
              + description = "Sample rule for a non-empty table"
              + dimension   = "VALIDITY"
              + ignore_null = false
              + name        = "not-empty-table"
              + threshold   = 0

              + table_condition_expectation {
                  + sql_expression = "COUNT(*) > 0"
                }
            }
        }

      + execution_spec {
          + trigger {
              + on_demand {}
            }
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
